/*
 * Click nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt to change this license
 * Click nbfs://nbhost/SystemFileSystem/Templates/Classes/Class.java to edit this template
 */
package falgorithmsproject;

/**
 *
 * @author meme
 */

public class LocationData {
    public static final String[] NAMES = {
        "جامعة الإمام", "جامعة الملك سعود", "جامعة الأميرة نوره", "سفارة الهند", "نادي الهلال السعودي",
        "قصر المصمك", "وزارة الدفاع", "النخيل مول", "سلام مول", "منتزه السويدي", "المتحف الوطني",
        "نادي الفروسية", "انتركونتيننتال الرياض", "استاد الملك فهد الدولي", "مركز الملك عبدالله المالي",
        "البنك السعودي المركزي", "مركز الرياض الدولي للمؤتمرات والمعارض", "المدينة الرقمية", "ريتزكارتون",
        "مطار الملك خالد الدولي", "المكان مول", "مكتبة الملك فهد الوطنية", "ذا زون", "فيا الرياض",
        "جامعة اليمامة", "نادي النصر السعودي", "عرقه بلازا", "ايكيا", "جامع الأميرة هيا", "مستشفى الحمادي",
        "مستشفى الملك فيصل التخصصي", "مستشفى الإمام عبدالرحمن الفيصل", "مستشفى الجافل", "مدينة الملك سعود الطبية",
        "المستشفى الجامعي لجامعة الإمام", "مستشفى الملك عبدالله الجامعي", "مستشفى واحة الصحة", "وزارة الداخلية",
        "شرفات", "البوليفارد", "مستشفى دلة-النخيل", "بيت1", "كلية الملك فهد الامنية", "مستشفى الدرعية",
        "شركة ارامكو السعودية", "محطة قطار سار", "نادي ديراب للقولف", "مستشفى اليرموك", "درة الرياض", "بيت2"
    };

    public static final double[][] COORDINATES = {
        {24.81418582857288, 46.69112540000001}, {24.72506033079908, 46.63839044782596}, {24.847352437787496, 46.72556200759584},
        {24.686267595131667, 46.630620658506345}, {24.60574278219949, 46.62458312883537}, {24.631224452609978, 46.71336967132887},
        {24.66898508166789, 46.71712828794501}, {24.76801119336468, 46.71491454232924}, {24.55893834072133, 46.637905728835364},
        {24.59734962620979, 46.69498226142968}, {24.647856949784508, 46.71066620212786}, {24.982817012473618, 46.778549292293526},
        {24.666745248867535, 46.692169728835374}, {24.78889538189176, 46.838992942329234}, {24.765779874755115, 46.64350029420437},
        {24.664124250301246, 46.68704945767076}, {24.75316823074471, 46.72679375767075}, {24.740422232212705, 46.6354193},
        {24.66583214902209, 46.63087752883537}, {24.96518179104352, 46.70265643185606}, {24.79107318069485, 46.61217017116463},
        {24.685691690140036, 46.68651144232925}, {24.73191242369224, 46.64934230000001}, {24.66715274135443, 46.62640973939482},
        {24.86356060960647, 46.593783371164626}, {24.581519525946117, 46.558985713493875}, {24.693773943170104, 46.607355713493874},
        {24.659387390277224, 46.78735215626386}, {24.555955050865986, 46.714055942329246}, {24.75697057743351, 46.709901305496146},
        {24.671407848808276, 46.676662594537405}, {24.528034203244516, 46.653067971164624}, {24.57856857014801, 46.604705342329254},
        {24.62956402602567, 46.69196464771003}, {24.812604880531275, 46.70410718591167}, {24.83616475589043, 46.722149842329245},
        {24.752687036674036, 46.72787230549625}, {24.67054529724508, 46.69575957116463}, {24.803906373639716, 46.673916228835374},
        {24.76954567543508, 46.60453252340763}, {24.747074769979893, 46.651678334332246}, {24.880969693737544, 46.82859936905502},
        {24.78364370683669, 46.85392407116463}, {24.788081182339223, 46.55862492883537}, {24.52484900448246, 46.87251652883538},
        {24.855530435029795, 46.763057228835365}, {24.434073807641575, 46.49073097116462}, {24.672022995408884, 46.86775048650612},
        {25.006762384762684, 46.49951845117305}, {24.570534637682943, 46.71346311449465}
    };

    public static final int[] HOSPITAL_LOCATIONS = {29, 30, 31, 32, 33, 34, 35, 36, 40, 43, 47};
}

